fvdhoef/aquarius-plus/System/esp32/main/NimBLE_Cpp/NimBLEDevice.cpp
/*
 * NimBLEDevice.cpp
 *
 *  Created: on Jan 24 2020
 *      Author H2zero
 *
 * Originally:
 *
 * BLEDevice.cpp
 *
 *  Created on: Mar 16, 2017
 *      Author: kolban
 */

#include "nimconfig.h"
#if defined(CONFIG_BT_ENABLED)

#    include "NimBLEDevice.h"
#    include "NimBLEUtils.h"

#    ifdef ESP_PLATFORM
#        include "esp_err.h"
#        include "esp_bt.h"
#        include "nvs_flash.h"
#        if defined(CONFIG_NIMBLE_CPP_IDF)
#            include "esp_nimble_hci.h"
#            include "nimble/nimble_port.h"
#            include "nimble/nimble_port_freertos.h"
#            include "host/ble_hs.h"
#            include "host/ble_hs_pvcy.h"
#            include "host/util/util.h"
#            include "services/gap/ble_svc_gap.h"
#            include "services/gatt/ble_svc_gatt.h"
#        else
#            include "nimble/esp_port/esp-hci/include/esp_nimble_hci.h"
#        endif
#    else
#        include "nimble/nimble/controller/include/controller/ble_phy.h"
#    endif

#    ifndef CONFIG_NIMBLE_CPP_IDF
#        include "nimble/porting/nimble/include/nimble/nimble_port.h"
#        include "nimble/porting/npl/freertos/include/nimble/nimble_port_freertos.h"
#        include "nimble/nimble/host/include/host/ble_hs.h"
#        include "nimble/nimble/host/include/host/ble_hs_pvcy.h"
#        include "nimble/nimble/host/util/include/host/util/util.h"
#        include "nimble/nimble/host/services/gap/include/services/gap/ble_svc_gap.h"
#        include "nimble/nimble/host/services/gatt/include/services/gatt/ble_svc_gatt.h"
#    endif

#    if defined(ESP_PLATFORM) && defined(CONFIG_ENABLE_ARDUINO_DEPENDS)
#        include "esp32-hal-bt.h"
#    endif

#    include "NimBLELog.h"

static const char *LOG_TAG = "NimBLEDevice";

/**
 * Singletons for the NimBLEDevice.
 */
static bool initialized = false;
#    if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
NimBLEScan *NimBLEDevice::m_pScan = nullptr;
#    endif
uint32_t NimBLEDevice::m_passkey = 123456;
bool     NimBLEDevice::m_synced  = false;

gap_event_handler      NimBLEDevice::m_customGapHandler = nullptr;
ble_gap_event_listener NimBLEDevice::m_listener;
#    if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
std::list<NimBLEClient *> NimBLEDevice::m_cList;
#    endif
std::list<NimBLEAddress>   NimBLEDevice::m_ignoreList;
std::vector<NimBLEAddress> NimBLEDevice::m_whiteList;
NimBLESecurityCallbacks   *NimBLEDevice::m_securityCallbacks = nullptr;
uint8_t                    NimBLEDevice::m_own_addr_type     = BLE_OWN_ADDR_PUBLIC;
#    ifdef ESP_PLATFORM
uint16_t NimBLEDevice::m_scanDuplicateSize = CONFIG_BTDM_SCAN_DUPL_CACHE_SIZE;
uint8_t  NimBLEDevice::m_scanFilterMode    = CONFIG_BTDM_SCAN_DUPL_TYPE;
#    endif

/**
 * @brief Retrieve the Scan object that we use for scanning.
 * @return The scanning object reference.  This is a singleton object.  The caller should not
 * try and release/delete it.
 */
#    if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
/* STATIC */
NimBLEScan *NimBLEDevice::getScan() {
    if (m_pScan == nullptr) {
        m_pScan = new NimBLEScan();
    }
    return m_pScan;
} // getScan
#    endif // #if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)

/**
 * @brief Creates a new client object and maintains a list of all client objects
 * each client can connect to 1 peripheral device.
 * @param [in] peerAddress An optional peer address that is copied to the new client
 * object, allows for calling NimBLEClient::connect(bool) without a device or address parameter.
 * @return A reference to the new client object.
 */
#    if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)
/* STATIC */
NimBLEClient *NimBLEDevice::createClient(NimBLEAddress peerAddress) {
    if (m_cList.size() >= NIMBLE_MAX_CONNECTIONS) {
        NIMBLE_LOGW(LOG_TAG, "Number of clients exceeds Max connections. Cur=%d Max=%d", m_cList.size(), NIMBLE_MAX_CONNECTIONS);
    }

    NimBLEClient *pClient = new NimBLEClient(peerAddress);
    m_cList.push_back(pClient);

    return pClient;
} // createClient

/**
 * @brief Delete the client object and remove it from the list.\n
 * Checks if it is connected or trying to connect and disconnects/stops it first.
 * @param [in] pClient A pointer to the client object.
 */
/* STATIC */
bool NimBLEDevice::deleteClient(NimBLEClient *pClient) {
    if (pClient == nullptr) {
        return false;
    }

    // Set the connection established flag to false to stop notifications
    // from accessing the attribute vectors while they are being deleted.
    pClient->m_connEstablished = false;
    int rc                     = 0;

    if (pClient->isConnected()) {
        rc = pClient->disconnect();
        if (rc != 0 && rc != BLE_HS_EALREADY && rc != BLE_HS_ENOTCONN) {
            return false;
        }

        while (pClient->isConnected()) {
            taskYIELD();
        }
        // Since we set the flag to false the app will not get a callback
        // in the disconnect event so we call it here for good measure.
        pClient->m_pClientCallbacks->onDisconnect(pClient);

    } else if (pClient->m_pTaskData != nullptr) {
        rc = ble_gap_conn_cancel();
        if (rc != 0 && rc != BLE_HS_EALREADY) {
            return false;
        }
        while (pClient->m_pTaskData != nullptr) {
            taskYIELD();
        }
    }

    m_cList.remove(pClient);
    delete pClient;

    return true;
} // deleteClient

/**
 * @brief Get the list of created client objects.
 * @return A pointer to the list of clients.
 */
/* STATIC */
std::list<NimBLEClient *> *NimBLEDevice::getClientList() {
    return &m_cList;
} // getClientList

/**
 * @brief Get the number of created client objects.
 * @return Number of client objects created.
 */
/* STATIC */
size_t NimBLEDevice::getClientListSize() {
    return m_cList.size();
} // getClientList

/**
 * @brief Get a reference to a client by connection ID.
 * @param [in] conn_id The client connection ID to search for.
 * @return A pointer to the client object with the spcified connection ID.
 */
/* STATIC */
NimBLEClient *NimBLEDevice::getClientByID(uint16_t conn_id) {
    for (auto it = m_cList.cbegin(); it != m_cList.cend(); ++it) {
        if ((*it)->getConnId() == conn_id) {
            return (*it);
        }
    }
    assert(0);
    return nullptr;
} // getClientByID

/**
 * @brief Get a reference to a client by peer address.
 * @param [in] peer_addr The address of the peer to search for.
 * @return A pointer to the client object with the peer address.
 */
/* STATIC */
NimBLEClient *NimBLEDevice::getClientByPeerAddress(const NimBLEAddress &peer_addr) {
    for (auto it = m_cList.cbegin(); it != m_cList.cend(); ++it) {
        if ((*it)->getPeerAddress().equals(peer_addr)) {
            return (*it);
        }
    }
    return nullptr;
} // getClientPeerAddress

/**
 * @brief Finds the first disconnected client in the list.
 * @return A pointer to the first client object that is not connected to a peer.
 */
/* STATIC */
NimBLEClient *NimBLEDevice::getDisconnectedClient() {
    for (auto it = m_cList.cbegin(); it != m_cList.cend(); ++it) {
        if (!(*it)->isConnected()) {
            return (*it);
        }
    }
    return nullptr;
} // getDisconnectedClient

#    endif // #if defined(CONFIG_BT_NIMBLE_ROLE_CENTRAL)

