fvdhoef/aquarius-plus/System/esp32/main/NimBLE_Cpp/NimBLEDevice.cpp
    int rc = ble_gap_unpair(&delAddr);
    if (rc != 0) {
        return false;
    }

    return true;
}

/**
 * @brief Checks if a peer device is bonded.
 * @param [in] address The address to check for bonding.
 * @returns true if bonded.
 */
/*STATIC*/
bool NimBLEDevice::isBonded(const NimBLEAddress &address) {
    ble_addr_t peer_id_addrs[MYNEWT_VAL(BLE_STORE_MAX_BONDS)];
    int        num_peers, rc;

    rc = ble_store_util_bonded_peers(&peer_id_addrs[0], &num_peers, MYNEWT_VAL(BLE_STORE_MAX_BONDS));
    if (rc != 0) {
        return false;
    }

    for (int i = 0; i < num_peers; i++) {
        NimBLEAddress storedAddr(peer_id_addrs[i]);
        if (storedAddr == address) {
            return true;
        }
    }

    return false;
}

/**
 * @brief Get the address of a bonded peer device by index.
 * @param [in] index The index to retrieve the peer address of.
 * @returns NimBLEAddress of the found bonded peer or nullptr if not found.
 */
/*STATIC*/
NimBLEAddress NimBLEDevice::getBondedAddress(int index) {
    ble_addr_t peer_id_addrs[MYNEWT_VAL(BLE_STORE_MAX_BONDS)];
    int        num_peers, rc;

    rc = ble_store_util_bonded_peers(&peer_id_addrs[0], &num_peers, MYNEWT_VAL(BLE_STORE_MAX_BONDS));
    if (rc != 0) {
        return nullptr;
    }

    if (index > num_peers || index < 0) {
        return nullptr;
    }

    return NimBLEAddress(peer_id_addrs[index]);
}
#    endif

/**
 * @brief Checks if a peer device is whitelisted.
 * @param [in] address The address to check for in the whitelist.
 * @returns true if the address is in the whitelist.
 */
/*STATIC*/
bool NimBLEDevice::onWhiteList(const NimBLEAddress &address) {
    for (auto &it : m_whiteList) {
        if (it == address) {
            return true;
        }
    }

    return false;
}

/**
 * @brief Add a peer address to the whitelist.
 * @param [in] address The address to add to the whitelist.
 * @returns true if successful.
 */
/*STATIC*/
bool NimBLEDevice::whiteListAdd(const NimBLEAddress &address) {
    if (NimBLEDevice::onWhiteList(address)) {
        return true;
    }

    m_whiteList.push_back(address);
    std::vector<ble_addr_t> wlVec;
    wlVec.reserve(m_whiteList.size());

    for (auto &it : m_whiteList) {
        ble_addr_t wlAddr;
        memcpy(&wlAddr.val, it.getNative(), 6);
        wlAddr.type = it.getType();
        wlVec.push_back(wlAddr);
    }

    int rc = ble_gap_wl_set(&wlVec[0], wlVec.size());
    if (rc != 0) {
        NIMBLE_LOGE(LOG_TAG, "Failed adding to whitelist rc=%d", rc);
        return false;
    }

    return true;
}

/**
 * @brief Remove a peer address from the whitelist.
 * @param [in] address The address to remove from the whitelist.
 * @returns true if successful.
 */
/*STATIC*/
bool NimBLEDevice::whiteListRemove(const NimBLEAddress &address) {
    if (!NimBLEDevice::onWhiteList(address)) {
        return true;
    }

    std::vector<ble_addr_t> wlVec;
    wlVec.reserve(m_whiteList.size());

    for (auto &it : m_whiteList) {
        if (it != address) {
            ble_addr_t wlAddr;
            memcpy(&wlAddr.val, it.getNative(), 6);
            wlAddr.type = it.getType();
            wlVec.push_back(wlAddr);
        }
    }

    int rc = ble_gap_wl_set(&wlVec[0], wlVec.size());
    if (rc != 0) {
        NIMBLE_LOGE(LOG_TAG, "Failed removing from whitelist rc=%d", rc);
        return false;
    }

    // Don't remove from the list unless NimBLE returned success
    for (auto it = m_whiteList.begin(); it < m_whiteList.end(); ++it) {
        if ((*it) == address) {
            m_whiteList.erase(it);
            break;
        }
    }

    return true;
}

/**
 * @brief Gets the count of addresses in the whitelist.
 * @returns The number of addresses in the whitelist.
 */
/*STATIC*/
size_t NimBLEDevice::getWhiteListCount() {
    return m_whiteList.size();
}

/**
 * @brief Gets the address at the vector index.
 * @param [in] index The vector index to retrieve the address from.
 * @returns the NimBLEAddress at the whitelist index or nullptr if not found.
 */
/*STATIC*/
NimBLEAddress NimBLEDevice::getWhiteListAddress(size_t index) {
    if (index > m_whiteList.size()) {
        NIMBLE_LOGE(LOG_TAG, "Invalid index; %u", index);
        return nullptr;
    }
    return m_whiteList[index];
}

/**
 * @brief Host reset, we pass the message so we don't make calls until resynced.
 * @param [in] reason The reason code for the reset.
 */
/* STATIC */
void NimBLEDevice::onReset(int reason) {
    if (!m_synced) {
        return;
    }

    m_synced = false;

    NIMBLE_LOGC(LOG_TAG, "Resetting state; reason=%d, %s", reason, NimBLEUtils::returnCodeToString(reason));

#    if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
    if (initialized) {
        if (m_pScan != nullptr) {
            m_pScan->onHostReset();
        }
    }
#    endif
} // onReset

/**
 * @brief Host resynced with controller, all clear to make calls to the stack.
 */
/* STATIC */
void NimBLEDevice::onSync(void) {
    NIMBLE_LOGI(LOG_TAG, "NimBle host synced.");
    // This check is needed due to potentially being called multiple times in succession
    // If this happens, the call to scan start may get stuck or cause an advertising fault.
    if (m_synced) {
        return;
    }

    /* Make sure we have proper identity address set (public preferred) */
    int rc = ble_hs_util_ensure_addr(0);
    assert(rc == 0);

#    ifndef ESP_PLATFORM
    rc = ble_hs_id_infer_auto(m_own_addr_type, &m_own_addr_type);
    if (rc != 0) {
        NIMBLE_LOGE(LOG_TAG, "error determining address type; rc=%d", rc);
        return;
    }
#    endif

    // Yield for housekeeping before returning to operations.
    // Occasionally triggers exception without.
    taskYIELD();

    m_synced = true;

    if (initialized) {
#    if defined(CONFIG_BT_NIMBLE_ROLE_OBSERVER)
        if (m_pScan != nullptr) {
            m_pScan->onHostSync();
        }
#    endif

    }
} // onSync

/**
 * @brief The main host task.
 */
/* STATIC */
void NimBLEDevice::host_task(void *param) {
    NIMBLE_LOGI(LOG_TAG, "BLE Host Task Started");

