fvdhoef/aquarius-plus/System/esp32/main/NimBLE_Cpp/NimBLEDevice.cpp
#    ifdef ESP_PLATFORM
/**
 * @brief Set the own address type.
 * @param [in] own_addr_type Own Bluetooth Device address type.\n
 * The available bits are defined as:
 * * 0x00: BLE_OWN_ADDR_PUBLIC
 * * 0x01: BLE_OWN_ADDR_RANDOM
 * * 0x02: BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT
 * * 0x03: BLE_OWN_ADDR_RPA_RANDOM_DEFAULT
 * @param [in] useNRPA If true, and address type is random, uses a non-resolvable random address.
 */
/*STATIC*/
void NimBLEDevice::setOwnAddrType(uint8_t own_addr_type, bool useNRPA) {
    m_own_addr_type = own_addr_type;
    switch (own_addr_type) {
#        ifdef CONFIG_IDF_TARGET_ESP32
        case BLE_OWN_ADDR_PUBLIC:
            ble_hs_pvcy_rpa_config(NIMBLE_HOST_DISABLE_PRIVACY);
            break;
#        endif
        case BLE_OWN_ADDR_RANDOM:
            setSecurityInitKey(BLE_SM_PAIR_KEY_DIST_ENC | BLE_SM_PAIR_KEY_DIST_ID);
#        ifdef CONFIG_IDF_TARGET_ESP32
            ble_hs_pvcy_rpa_config(useNRPA ? NIMBLE_HOST_ENABLE_NRPA : NIMBLE_HOST_ENABLE_RPA);
#        endif
            break;
        case BLE_OWN_ADDR_RPA_PUBLIC_DEFAULT:
        case BLE_OWN_ADDR_RPA_RANDOM_DEFAULT:
            setSecurityInitKey(BLE_SM_PAIR_KEY_DIST_ENC | BLE_SM_PAIR_KEY_DIST_ID);
#        ifdef CONFIG_IDF_TARGET_ESP32
            ble_hs_pvcy_rpa_config(NIMBLE_HOST_ENABLE_RPA);
#        endif
            break;
    }
} // setOwnAddrType
#    endif

/**
 * @brief Start the connection securing and authorization for this connection.
 * @param conn_id The connection id of the peer device.
 * @returns NimBLE stack return code, 0 = success.
 */
/* STATIC */
int NimBLEDevice::startSecurity(uint16_t conn_id) {
    int rc = ble_gap_security_initiate(conn_id);
    if (rc != 0) {
        NIMBLE_LOGE(LOG_TAG, "ble_gap_security_initiate: rc=%d %s", rc, NimBLEUtils::returnCodeToString(rc));
    }

    return rc;
} // startSecurity

/**
 * @brief Check if the device address is on our ignore list.
 * @param [in] address The address to look for.
 * @return True if ignoring.
 */
/*STATIC*/
bool NimBLEDevice::isIgnored(const NimBLEAddress &address) {
    for (auto &it : m_ignoreList) {
        if (it.equals(address)) {
            return true;
        }
    }

    return false;
}

/**
 * @brief Add a device to the ignore list.
 * @param [in] address The address of the device we want to ignore.
 */
/*STATIC*/
void NimBLEDevice::addIgnored(const NimBLEAddress &address) {
    m_ignoreList.push_back(address);
}

/**
 * @brief Remove a device from the ignore list.
 * @param [in] address The address of the device we want to remove from the list.
 */
/*STATIC*/
void NimBLEDevice::removeIgnored(const NimBLEAddress &address) {
    for (auto it = m_ignoreList.begin(); it != m_ignoreList.end(); ++it) {
        if ((*it).equals(address)) {
            m_ignoreList.erase(it);
            return;
        }
    }
}

/**
 * @brief Set a custom callback for gap events.
 * @param [in] handler The function to call when gap events occur.
 */
/*STATIC*/
void NimBLEDevice::setCustomGapHandler(gap_event_handler handler) {
    m_customGapHandler = handler;
    int rc             = ble_gap_event_listener_register(&m_listener, m_customGapHandler, NULL);
    if (rc == BLE_HS_EALREADY) {
        NIMBLE_LOGI(LOG_TAG, "Already listening to GAP events.");
    } else {
        assert(rc == 0);
    }
} // setCustomGapHandler

#endif // CONFIG_BT_ENABLED
